tests/Mock/payments/000000895910000023670000200001/refund.200.txt

HTTP/1.1 200 OK
Connection: close
Date: Sat, 16 Feb 2013 04:22:58 GMT
Server: Microsoft-IIS/6.0
X-Powered-By: ASP.NET
Content-Type: application/json
Content-Length: 638
Cache-Control: private, must-revalidate, max-age=0
Expires: Tue, 01 Jan 1980 00:00:00 GMT

{
  "id" : "00000085001000006995000-300001",
  "refundOutput" : {
    "amountOfMoney" : {
      "amount" : 1,
      "currencyCode" : "EUR"
    },
    "references" : {
      "merchantReference" : "AcmeOrder0001",
      "paymentReference" : "0"
    },
    "paymentMethod" : "card",
    "cardRefundMethodSpecificOutput": {
      "totalAmountPaid" : 2890,
      "totalAmountRefunded" : 0
    }
  },
  "status" : "PENDING_APPROVAL",
  "statusOutput" : {
       "isCancellable" : true,
       "statusCategory" : "PENDING_CONNECT_OR_3RD_PARTY",
       "statusCode" : 800,
       "statusCodeChangeDateTime" : "20170408200951",
       "isAuthorized" : false,
       "isRefundable" : false
    }
}